
#Область ОписаниеПеременных
#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ЗаполнитьТабличнуюЧастьКлиенты();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы<ИмяТаблицыФормы>
// Код процедур и функций
//#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СопоставитьКлиентовСУТ10(Команда)
	СопоставитьКлиентовСУТ10НаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СопоставитьКлиентовСУТ10НаСервере()
	тз = ПолучитьКлиентовУТ();
	
	Для каждого Стр Из тз.КлиентыУТ10 Цикл
		Пойск = Новый Структура("Код", Стр.КодУМЦ);
		НайденныеСтроки = Объект.Клиенты.НайтиСтроки(Пойск);
		
		Если (НайденныеСтроки.Количество() <> 0) Тогда
			ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Стр);
			
			Если (НайденныеСтроки[0].ЗаказПокупателяУТ10 = 0 И
				НайденныеСтроки[0].ДокументПродажиУТ10 = 0) Тогда
				
				НайденныеСтроки[0].ПометитьНаУдалениеВУТ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлиентовУМЦ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК Клиент,
		|	Клиенты.Код КАК Код
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	НЕ Клиенты.ЭтоГруппа
		|	И Клиенты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса
КонецФункции // ПолучитьКлиентовУМЦ()

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьКлиенты()
	Объект.Клиенты.Загрузить(ПолучитьКлиентовУМЦ());
КонецПроцедуры

Функция ПолучитьКлиентовУТ()
	
	Подключение =  DL_ДоработкиСервер.ВыполнитьПодключениеЧерезCOM();

	comКоды = Подключение.NewObject("СписокЗначений");
	Для каждого Стр Из Объект.Клиенты Цикл
		comКоды.Добавить(Стр.Код);
	КонецЦикла;
	
	ВнешЗапрос = Подключение.NewObject("Запрос");
	ВнешЗапрос.УстановитьПараметр("Коды", comКоды);
	ВнешЗапрос.Текст = "
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	ВЫРАЗИТЬ(Контрагенты.ДокументУдостоверяющийЛичность КАК СТРОКА(25)) КАК КодУМЦ,
	|	Контрагенты.ПометкаУдаления,
	|	Контрагенты.Наименование,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(255)) КАК НаименованиеПолное,
	|	Контрагенты.Код КАК КодУТ
	|ПОМЕСТИТЬ втКонтрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ЭтоГруппа
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКонтрагенты.НаименованиеПолное КАК КлиентУТ10,
	|	втКонтрагенты.КодУМЦ,
	|	втКонтрагенты.КодУТ КАК КлиентыУТ10Код,
	|	втКонтрагенты.ПометкаУдаления КАК КлиентУт10ПометкаУдаления,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказыПокупателейОбороты.ЗаказПокупателя) КАК ЗаказПокупателяУТ10,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.ДокументПродажи) КАК ДокументПродажиУТ10
	|ИЗ
	|	втКонтрагенты КАК втКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Обороты КАК ЗаказыПокупателейОбороты
	|		ПО втКонтрагенты.Ссылка = ЗаказыПокупателейОбороты.ЗаказПокупателя.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
	|		ПО втКонтрагенты.Ссылка = ПродажиОбороты.Контрагент
	|ГДЕ
	|	втКонтрагенты.КодУМЦ В(&Коды)

	|СГРУППИРОВАТЬ ПО
	|	втКонтрагенты.КодУМЦ,
	|	втКонтрагенты.ПометкаУдаления,
	|	втКонтрагенты.НаименованиеПолное,
	|	втКонтрагенты.КодУТ
	|";
	
	мВнешТз = ВнешЗапрос.Выполнить();
	тз = ЗначениеИзСтрокиВнутр(Подключение.ЗначениеВСтрокуВнутр(мВнешТз));
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("КлиентыУТ10", тз.Выгрузить());
	Возврат ВнешниеНаборыДанных;
КонецФункции 

&НаСервере
Процедура УстановитьПометкуУдаленияВУТНаСервере()
	Подключение =  DL_ДоработкиСервер.ВыполнитьПодключениеЧерезCOM();

	comКонтрагенты = Подключение.Справочники.Контрагенты;
	
	
	ВсегоПомечено = 0;
	Для каждого Стр Из Объект.Клиенты Цикл
		Если (Не ЗначениеЗаполнено(Стр.КлиентыУТ10Код)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если (Стр.ПометитьНаУдалениеВУТ) Тогда
			comНайденныйЭлемент = comКонтрагенты.FindByCode(Стр.КлиентыУТ10Код);
			
			Если (comНайденныйЭлемент <> comКонтрагенты.ПустаяСсылка()) Тогда
				comКонтагентОбъект = comНайденныйЭлемент.ПолучитьОбъект();
				comКонтагентОбъект.ДополнительноеОписание = comКонтагентОбъект.ДополнительноеОписание + "    Клиент помечен на удаление из УМЦ";
				comКонтагентОбъект.ПометкаУдаления = Истина;
				comКонтагентОбъект.Записать();
				
				Сообщить(Стр.КлиентыУТ10Код + " " + Стр.КлиентУТ10 + " помечен на удаление в УТ", СтатусСообщения.Информация);
				ВсегоПомечено = ВсегоПомечено + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Всего помечено на удаление " + ВсегоПомечено + " элементов", СтатусСообщения.Информация);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияВУТ(Команда)
	УстановитьПометкуУдаленияВУТНаСервере();
КонецПроцедуры

#КонецОбласти